In [8]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [7]:
#Assume H0 (Null hypothesis) = mu1=mu2 ( There is no difference in diameters of cutlets between two units)
 # H1 (Alternate Hypothesis) = mu1=!mu2 (there is slight difference in diameters of cutlets between two units)
     # use two tail sample test

In [11]:
Q1 = pd.read_csv("C:/Users\sunil\Downloads\Cutlets.csv")

In [12]:
Q1.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [21]:
unitA = pd.Series(Q1.iloc[:,0])
unitA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [23]:
unitB =pd.Series(Q1.iloc[:,1])
unitB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [34]:
p_value=stats.ttest_ind(unitA,unitB)

In [35]:
p_value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [ ]:
#here p_value = 0.4722 which is much greater than given significance value (0.05) so this is null hypothesis.

In [9]:
Q2 = pd.read_csv("C:/Users\sunil\Downloads\LabTat.csv")

In [10]:
Q2.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [14]:
Lab1 = pd.Series(Q2.iloc[:,0])
Lab1

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [16]:
Lab2 = pd.Series(Q2.iloc[:,1])
Lab2

0      165.53
1      185.91
2      194.92
3      183.00
4      169.57
        ...
115    170.66
116    183.98
117    174.54
118    197.18
119    215.17
Name: Laboratory 2, Length: 120, dtype: float64

In [18]:
Lab3 =pd.Series(Q2.iloc[:,2])
Lab3

0      176.70
1      198.45
2      201.23
3      199.61
4      204.63
        ...
115    193.80
116    215.25
117    203.99
118    194.52
119    221.49
Name: Laboratory 3, Length: 120, dtype: float64

In [20]:
Lab4 =pd.Series(Q2.iloc[:,3])
Lab4

0      166.13
1      160.79
2      185.18
3      176.42
4      152.60
        ...
115    172.68
116    177.64
117    170.27
118    150.87
119    162.21
Name: Laboratory 4, Length: 120, dtype: float64

In [ ]:
#Assume, H0 = there is no difference in mean of all TAT of lab reports.
#       HA = mean of one of the lab report is different
# given significance value is 0.05

In [34]:
#using F anova test
import scipy.stats as stats
p_value = stats.f_oneway(Lab1,Lab2,Lab3,Lab4)
p_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [ ]:
# Here, p_value < 0.05 therefore there is no difference in all TAT lab reports.

In [25]:
Q3 = pd.read_csv("C:/Users\sunil\Downloads\BuyerRatio.csv")

In [26]:
Q3.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [43]:
data = [[50,142,131,70],[435,1523,1356,750]]

In [31]:
Q3.values

array([['Males', 50, 142, 131, 70],
       ['Females', 435, 1523, 1356, 750]], dtype=object)

In [40]:
from scipy.stats import chi2_contingency

In [45]:
chi2_contingency(data) #(stats,p_value,df,expected data)

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
        [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [ ]:
#here, p_value > alpha(0.05)
#now here we are going to accept the null hypothesis as p_value > 0.05.
#all the proportions of males and females are equal in all the regions.

# Q4

In [46]:

Q4 = pd.read_csv("C:/Users\sunil\Downloads\Costomer+OrderForm.csv")

In [47]:
Q4.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [48]:
Q4.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [59]:
data1 = Q4["Phillippines"].value_counts()
data1

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [63]:
data2 = Q4["Indonesia"].value_counts()
data2

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [64]:
data3 = Q4["Malta"].value_counts()
data3

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [65]:
data4 = Q4["India"].value_counts()
data4

Error Free    280
Defective      20
Name: India, dtype: int64

In [67]:
Array =[[271,267,269,280],[29,33,31,20]]
Array

[[271, 267, 269, 280], [29, 33, 31, 20]]

In [ ]:
# Assume H0 = No error p_value >0.05
#       HA = theres some error if p_value < 0.05

In [68]:
chi2_contingency(Array) #(stats,p_value,df,expected value)

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[271.75, 271.75, 271.75, 271.75],
        [ 28.25,  28.25,  28.25,  28.25]]))

In [ ]:
# p_value > 0.05 (significance value)
 # so we accept the null hypothesis.